In [26]:
import pandas as pd

In [27]:
df = pd.read_csv('../static/data/SBER.ME.csv')
df.head()

         Date    Open   Close    High     Low    Volume
0  2019-07-09  243.00  242.74  243.70  241.87  26380230
1  2019-07-08  242.13  243.30  243.30  240.68  28620550
2  2019-07-05  242.91  242.83  243.50  241.61  27870840
3  2019-07-03  241.00  241.51  243.70  240.17  32731470
4  2019-07-02  242.51  241.20  242.74  239.70  28583620

In [28]:
df.dtypes

Date       object
Open      float64
Close     float64
High      float64
Low       float64
Volume      int64
dtype: object

In [29]:
df['Date'] = pd.to_datetime(df['Date'], errors='ignore')
df.set_index('Date', inplace=True)
df.head()

              Open   Close    High     Low    Volume
Date
2019-07-09  243.00  242.74  243.70  241.87  26380230
2019-07-08  242.13  243.30  243.30  240.68  28620550
2019-07-05  242.91  242.83  243.50  241.61  27870840
2019-07-03  241.00  241.51  243.70  240.17  32731470
2019-07-02  242.51  241.20  242.74  239.70  28583620

In [30]:
df.dtypes

Open      float64
Close     float64
High      float64
Low       float64
Volume      int64
dtype: object

In [31]:
aggregator = {'Open'  : 'first',
              'Close' : 'last',
              'High'  : 'max',
              'Low'   : 'min',
              'Volume': 'sum'}

In [32]:
offset = pd.offsets.timedelta(days=-6)

In [35]:
df = df.resample('W', loffset=offset).apply(aggregator)
df.head()

             Open  Close   High    Low      Volume
Date
2011-11-21  79.00  78.27  79.37  73.75  1398299520
2011-11-28  80.00  89.50  91.28  79.52  1823407264
2011-12-05  89.56  82.40  90.52  81.65  1476596208
2011-12-12  83.51  80.63  84.80  78.03  1557906960
2011-12-19  80.10  80.00  84.00  77.42  1397987068